{
  "poetryfoundation.org/poems/51642/invictus": {
    "title": "Invictus",
    "author": "William Ernest Henley",
    "type": "poem",
    "text": "Out of the night that covers me,\nBlack as the pit from pole to pole,\nI thank whatever gods may be\nFor my unconquerable soul.\n\nIn the fell clutch of circumstance\nI have not winced nor cried aloud.\nUnder the bludgeonings of chance\nMy head is bloody, but unbowed.\n\nBeyond this place of wrath and tears\nLooms but the Horror of the shade,\nAnd yet the menace of the years\nFinds and shall find me unafraid.\n\nIt matters not how strait the gate,\nHow charged with punishments the scroll,\nI am the master of my fate,\nI am the captain of my soul."
  },
  "poetryfoundation.org/poems/46473/if---": {
    "title": "If—",
    "author": "Rudyard Kipling",
    "type": "poem",
    "text": "If you can keep your head when all about you\nAre losing theirs and blaming it on you,\nIf you can trust yourself when all men doubt you,\nBut make allowance for their doubting too;\nIf you can wait and not be tired by waiting,\nOr being lied about, don't deal in lies,\nOr being hated, don't give way to hating,\nAnd yet don't look too good, nor talk too wise:\n\nIf you can dream—and not make dreams your master;\nIf you can think—and not make thoughts your aim;\nIf you can meet with Triumph and Disaster\nAnd treat those two impostors just the same;\nIf you can bear to hear the truth you've spoken\nTwisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\nAnd stoop and build 'em up with worn-out tools:\n\nIf you can make one heap of all your winnings\nAnd risk it on one turn of pitch-and-toss,\nAnd lose, and start again at your beginnings\nAnd never breathe a word about your loss;\nIf you can force your heart and nerve and sinew\nTo serve your turn long after they are gone,\nAnd so hold on when there is nothing in you\nExcept the Will which says to them: 'Hold on!'\n\nIf you can talk with crowds and keep your virtue,\nOr walk with Kings—nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\nIf all men count with you, but none too much;\nIf you can fill the unforgiving minute\nWith sixty seconds' worth of distance run,\nYours is the Earth and everything that's in it,\nAnd—which is more—you'll be a Man, my son!"
  },
  "poetryfoundation.org/poems/44272/the-road-not-taken": {
    "title": "The Road Not Taken",
    "author": "Robert Frost",
    "type": "poem",
    "text": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;\n\nThen took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear;\nThough as for that the passing there\nHad worn them really about the same,\n\nAnd both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads on to way,\nI doubted if I should ever come back.\n\nI shall be telling this with a sigh\nSomewhere ages and ages hence:\nTwo roads diverged in a wood, and I—\nI took the one less traveled by,\nAnd that has made all the difference."
  },
  "poetryfoundation.org/poems/46565/ozymandias": {
    "title": "Ozymandias",
    "author": "Percy Bysshe Shelley",
    "type": "poem",
    "text": "I met a traveller from an antique land,\nWho said—\"Two vast and trunkless legs of stone\nStand in the desert. . . . Near them, on the sand,\nHalf sunk a shattered visage lies, whose frown,\nAnd wrinkled lip, and sneer of cold command,\nTell that its sculptor well those passions read\nWhich yet survive, stamped on these lifeless things,\nThe hand that mocked them, and the heart that fed;\nAnd on the pedestal, these words appear:\nMy name is Ozymandias, King of Kings;\nLook on my Works, ye Mighty, and despair!\nNothing beside remains. Round the decay\nOf that colossal Wreck, boundless and bare\nThe lone and level sands stretch far away.\""
  },
  "poetryfoundation.org/poems/45319/the-charge-of-the-light-brigade": {
    "title": "The Charge of the Light Brigade",
    "author": "Alfred Lord Tennyson",
    "type": "poem",
    "text": "Half a league, half a league,\nHalf a league onward,\nAll in the valley of Death\nRode the six hundred.\n\"Forward, the Light Brigade!\nCharge for the guns!\" he said.\nInto the valley of Death\nRode the six hundred.\n\n\"Forward, the Light Brigade!\"\nWas there a man dismayed?\nNot though the soldier knew\nSomeone had blundered.\nTheirs not to make reply,\nTheirs not to reason why,\nTheirs but to do and die.\nInto the valley of Death\nRode the six hundred.\n\nCannon to right of them,\nCannon to left of them,\nCannon in front of them\nVolleyed and thundered;\nStormed at with shot and shell,\nBoldly they rode and well,\nInto the jaws of Death,\nInto the mouth of hell\nRode the six hundred.\n\nFlashed all their sabres bare,\nFlashed as they turned in air\nSabring the gunners there,\nCharging an army, while\nAll the world wondered.\nPlunged in the battery-smoke\nRight through the line they broke;\nCossack and Russian\nReeled from the sabre stroke\nShattered and sundered.\nThen they rode back, but not\nNot the six hundred.\n\nCannon to right of them,\nCannon to left of them,\nCannon behind them\nVolleyed and thundered;\nStormed at with shot and shell,\nWhile horse and hero fell.\nThey that had fought so well\nCame through the jaws of Death,\nBack from the mouth of hell,\nAll that was left of them,\nLeft of six hundred.\n\nWhen can their glory fade?\nO the wild charge they made!\nAll the world wondered.\nHonour the charge they made!\nHonour the Light Brigade,\nNoble six hundred!"
  },
  "poetryfoundation.org/poems/46446/still-i-rise": {
    "title": "Still I Rise",
    "author": "Maya Angelou",
    "type": "poem",
    "text": "You may write me down in history\nWith your bitter, twisted lies,\nYou may trod me in the very dirt\nBut still, like dust, I'll rise.\n\nDoes my sassiness upset you?\nWhy are you beset with gloom?\n'Cause I walk like I've got oil wells\nPumping in my living room.\n\nJust like moons and like suns,\nWith the certainty of tides,\nJust like hopes springing high,\nStill I'll rise.\n\nDid you want to see me broken?\nBowed head and lowered eyes?\nShoulders falling down like teardrops,\nWeakened by my soulful cries?\n\nDoes my haughtiness offend you?\nDon't you take it awful hard\n'Cause I laugh like I've got gold mines\nDiggin' in my own backyard.\n\nYou may shoot me with your words,\nYou may cut me with your eyes,\nYou may kill me with your hatefulness,\nBut still, like air, I'll rise.\n\nDoes my sexiness upset you?\nDoes it come as a surprise\nThat I dance like I've got diamonds\nAt the meeting of my thighs?\n\nOut of the huts of history's shame\nI rise\nUp from a past that's rooted in pain\nI rise\nI'm a black ocean, leaping and wide,\nWelling and swelling I bear in the tide.\n\nLeaving behind nights of terror and fear\nI rise\nInto a daybreak that's wondrously clear\nI rise\nBringing the gifts that my ancestors gave,\nI am the dream and the hope of the slave.\nI rise\nI rise\nI rise."
  },
  "poetryfoundation.org/poems/47311/the-waste-land": {
    "title": "The Waste Land",
    "author": "T.S. Eliot",
    "type": "poem",
    "text": "I. The Burial of the Dead\n\nApril is the cruellest month, breeding\nLilacs out of the dead land, mixing\nMemory and desire, stirring\nDull roots with spring rain.\nWinter kept us warm, covering\nEarth in forgetful snow, feeding\nA little life with dried tubers.\nSummer surprised us, coming over the Starnbergersee\nWith a shower of rain; we stopped in the colonnade,\nAnd went on in sunlight, into the Hofgarten,\nAnd drank coffee, and talked for an hour.\nBin gar keine Russin, stamm' aus Litauen, echt deutsch.\nAnd when we were children, staying at the arch-duke's,\nMy cousin's, he took me out on a sled,\nAnd I was frightened. He said, Marie,\nMarie, hold on tight. And down we went.\nIn the mountains, there you feel free.\nI read, much of the night, and go south in the winter.\n\nWhat are the roots that clutch, what branches grow\nOut of this stony rubbish? Son of man,\nYou cannot say, or guess, for you know only\nA heap of broken images, where the sun beats,\nAnd the dead tree gives no shelter, the cricket no relief,\nAnd the dry stone no sound of water. Only\nThere is shadow under this red rock,\n(Come in under the shadow of this red rock),\nAnd I will show you something different from either\nYour shadow at morning striding behind you\nOr your shadow at evening rising to meet you;\nI will show you fear in a handful of dust.\n\nFrisch weht der Wind\nDer Heimat zu\nMein Irisch Kind,\nWo weilest du?\n\n\"You gave me hyacinths first a year ago;\nThey called me the hyacinth girl.\"\n—Yet when we came back, late, from the Hyacinth garden,\nYour arms full, and your hair wet, I could not\nSpeak, and my eyes failed, I was neither\nLiving nor dead, and I knew nothing,\nLooking into the heart of light, the silence.\nOed' und leer das Meer.\n\nMadame Sosostris, famous clairvoyante,\nHad a bad cold, nevertheless\nIs known to be the wisest woman in Europe,\nWith a wicked pack of cards. Here, said she,\nIs your card, the drowned Phoenician Sailor,\n(Those are pearls that were his eyes. Look!)\nHere is Belladonna, the Lady of the Rocks,\nThe lady of situations.\nHere is the man with three staves, and here the Wheel,\nAnd here is the one-eyed merchant, and this card,\nWhich is blank, is something he carries on his back,\nWhich I am forbidden to see. I do not find\nThe Hanged Man. Fear death by water.\nI see crowds of people, walking round in a ring.\nThank you. If you see dear Mrs. Equitone,\nTell her I bring the horoscope myself:\nOne must be so careful these days.\n\nUnreal City,\nUnder the brown fog of a winter dawn,\nA crowd flowed over London Bridge, so many,\nI had not thought death had undone so many.\nSighs, short and infrequent, were exhaled,\nAnd each man fixed his eyes before his feet.\nFlowed up the hill and down King William Street,\nTo where Saint Mary Woolnoth kept the hours\nWith a dead sound on the final stroke of nine.\nThere I saw one I knew, and stopped him, crying: \"Stetson!\nYou who were with me in the ships at Mylae!\nThat corpse you planted last year in your garden,\nHas it begun to sprout? Will it bloom this year?\nOr has the sudden frost disturbed its bed?\nOh keep the Dog far hence, that's friend to men,\nOr with his nails he'll dig it up again!\nYou! hypocrite lecteur!—mon semblable,—mon frère!\"\n\nII. A Game of Chess\n\nThe Chair she sat in, like a burnished throne,\nGlowed on the marble, where the glass\nHeld up by standards wrought with fruited vines\nFrom which a golden Cupidon peeped out\n(Another hid his eyes behind his wing)\nDoubled the flames of sevenbranched candelabra\nReflecting light upon the table as\nThe glitter of her jewels rose to meet it,\nFrom satin cases poured in rich profusion;\nIn vials of ivory and coloured glass\nUnstoppered, lurked her strange synthetic perfumes,\nUnguent, powdered, or liquid—troubled, confused\nAnd drowned the sense in odours; stirred by the air\nThat freshened from the window, these ascended\nIn fattening the prolonged candle-flames,\nFlung their smoke into the laquearia,\nStirring the pattern on the coffered ceiling.\nHuge sea-wood fed with copper\nBurned green and orange, framed by the coloured stone,\nIn which sad light a carved dolphin swam.\nAbove the antique mantel was displayed\nAs though a window gave upon the sylvan scene\nThe change of Philomel, by the barbarous king\nSo rudely forced; yet there the nightingale\nFilled all the desert with inviolable voice\nAnd still she cried, and still the world pursues,\n\"Jug Jug\" to dirty ears.\nAnd other withered stumps of time\nWere told upon the walls; staring forms\nLeaned out, leaning, hushing the room enclosed.\nFootsteps shuffled on the stair.\nUnder the firelight, under the brush, her hair\nSpread out in fiery points\nGlowed into words, then would be savagely still.\n\n\"My nerves are bad tonight. Yes, bad. Stay with me.\nSpeak to me. Why do you never speak. Speak.\nWhat are you thinking of? What thinking? What?\nI never know what you are thinking. Think.\"\n\nI think we are in rats' alley\nWhere the dead men lost their bones.\n\n\"What is that noise?\"\nThe wind under the door.\n\"What is that noise now? What is the wind doing?\"\nNothing again nothing.\n\"Do\nYou know nothing? Do you see nothing? Do you remember\nNothing?\"\n\nI remember\nThose are pearls that were his eyes.\n\"Are you alive, or not? Is there nothing in your head?\"\nBut\nO O O O that Shakespeherian Rag—\nIt's so elegant\nSo intelligent\n\"What shall I do now? What shall I do?\"\n\"I shall rush out as I am, and walk the street\nWith my hair down, so. What shall we do tomorrow?\nWhat shall we ever do?\"\nThe hot water at ten.\nAnd if it rains, a closed car at four.\nAnd we shall play a game of chess,\nPressing lidless eyes and waiting for a knock upon the door.\n\nWhen Lil's husband got demobbed, I said—\nI didn't mince my words, I said to her myself,\nHURRY UP PLEASE ITS TIME\nNow Albert's coming back, make yourself a bit smart.\nHe'll want to know what you done with that money he gave you\nTo get yourself some teeth. He did, I was there.\nYou have them all out, Lil, and get a nice set,\nHe said, I swear, I can't bear to look at you.\nAnd no more can't I, I said, and think of poor Albert,\nHe's been in the army four years, he wants a good time,\nAnd if you don't give it him, there's others will, I said.\nOh is there, she said. Something o' that, I said.\nThen I'll know who to thank, she said, and give me a straight look.\nHURRY UP PLEASE ITS TIME\nIf you don't like it you can get on with it, I said.\nOthers can pick and choose if you can't.\nBut if Albert makes off, it won't be for lack of telling.\nYou ought to be ashamed, I said, to look so antique.\n(And her only thirty-one.)\nI can't help it, she said, pulling a long face,\nIt's them pills I took, to bring it off, she said.\n(She's had five already, and nearly died of young George.)\nThe chemist said it would be all right, but I've never been the same.\nYou are a proper fool, I said.\nWell, if Albert won't leave you alone, there it is, I said,\nWhat you get married for if you don't want children?\nHURRY UP PLEASE ITS TIME\nWell, that Sunday Albert was home, they had a hot gammon,\nAnd they asked me in to dinner, to get the beauty of it hot—\nHURRY UP PLEASE ITS TIME\nHURRY UP PLEASE ITS TIME\nGoonight Bill. Goonight Lou. Goonight May. Goonight.\nTa ta. Goonight. Goonight.\nGood night, ladies, good night, sweet ladies, good night, good night."
  },
  "poetryfoundation.org/poems/45477/song-of-myself-1892-version": {
    "title": "Song of Myself (excerpt)",
    "author": "Walt Whitman",
    "type": "poem",
    "text": "I celebrate myself, and sing myself,\nAnd what I assume you shall assume,\nFor every atom belonging to me as good belongs to you.\n\nI loafe and invite my soul,\nI lean and loafe at my ease observing a spear of summer grass.\n\nMy tongue, every atom of my blood, form'd from this soil, this air,\nBorn here of parents born here from parents the same, and their parents the same,\nI, now thirty-seven years old in perfect health begin,\nHoping to cease not till death.\n\nCreeds and schools in abeyance,\nRetiring back a while sufficed at what they are, but never forgotten,\nI harbor for good or bad, I permit to speak at every hazard,\nNature without check with original energy.\n\nHouses and rooms are full of perfumes, the shelves are crowded with perfumes,\nI breathe the fragrance myself and know it and like it,\nThe distillation would intoxicate me also, but I shall not let it.\n\nThe atmosphere is not a perfume, it has no taste of the distillation, it is odorless,\nIt is for my mouth forever, I am in love with it,\nI will go to the bank by the wood and become undisguised and naked,\nI am mad for it to be in contact with me.\n\nThe smoke of my own breath,\nEchoes, ripples, buzz'd whispers, love-root, silk-thread, crotch and vine,\nMy respiration and inspiration, the beating of my heart, the passing of blood and air through my lungs,\nThe sniff of green leaves and dry leaves, and of the shore and dark-color'd sea-rocks, and of hay in the barn,\nThe sound of the belch'd words of my voice loos'd to the eddies of the wind,\nA few light kisses, a few embraces, a reaching around of arms,\nThe play of shine and shade on the trees as the supple boughs wag,\nThe delight alone or in the rush of the streets, or along the fields and hill-sides,\nThe feeling of health, the full-noon trill, the song of me rising from bed and meeting the sun.\n\nHave you reckon'd a thousand acres much? have you reckon'd the earth much?\nHave you practis'd so long to learn to read?\nHave you felt so proud to get at the meaning of poems?\n\nStop this day and night with me and you shall possess the origin of all poems,\nYou shall possess the good of the earth and sun, (there are millions of suns left,)\nYou shall no longer take things at second or third hand, nor look through the eyes of the dead, nor feed on the spectres in books,\nYou shall not look through my eyes either, nor take things from me,\nYou shall listen to all sides and filter them from your self."
  },
  "poetryfoundation.org/poems/48860/the-raven": {
    "title": "The Raven",
    "author": "Edgar Allan Poe",
    "type": "poem",
    "text": "Once upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore—\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of some one gently rapping, rapping at my chamber door.\n\"'Tis some visitor,\" I muttered, \"tapping at my chamber door—\nOnly this and nothing more.\"\n\nAh, distinctly I remember it was in the bleak December;\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow;—vainly I had sought to borrow\nFrom my books surcease of sorrow—sorrow for the lost Lenore—\nFor the rare and radiant maiden whom the angels name Lenore—\nNameless here for evermore.\n\nAnd the silken, sad, uncertain rustling of each purple curtain\nThrilled me—filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n\"'Tis some visitor entreating entrance at my chamber door—\nSome late visitor entreating entrance at my chamber door;—\nThis it is and nothing more.\"\n\nPresently my soul grew stronger; hesitating then no longer,\n\"Sir,\" said I, \"or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you\"—here I opened wide the door;—\nDarkness there and nothing more.\n\nDeep into that darkness peering, long I stood there wondering, fearing,\nDoubting, dreaming dreams no mortal ever dared to dream before;\nBut the silence was unbroken, and the stillness gave no token,\nAnd the only word there spoken was the whispered word, \"Lenore?\"\nThis I whispered, and an echo murmured back the word, \"Lenore!\"—\nMerely this and nothing more.\n\nBack into the chamber turning, all my soul within me burning,\nSoon again I heard a tapping somewhat louder than before.\n\"Surely,\" said I, \"surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore—\nLet my heart be still a moment and this mystery explore;—\n'Tis the wind and nothing more!\"\n\nOpen here I flung the shutter, when, with many a flirt and flutter,\nIn there stepped a stately Raven of the saintly days of yore;\nNot the least obeisance made he; not a minute stopped or stayed he;\nBut, with mien of lord or lady, perched above my chamber door—\nPerched upon a bust of Pallas just above my chamber door—\nPerched, and sat, and nothing more.\n\nThen this ebony bird beguiling my sad fancy into smiling,\nBy the grave and stern decorum of the countenance it wore,\n\"Though thy crest be shorn and shaven, thou,\" I said, \"art sure no craven,\nGhastly grim and ancient Raven wandering from the Nightly shore—\nTell me what thy lordly name is on the Night's Plutonian shore!\"\nQuoth the Raven \"Nevermore.\"\n\nMuch I marvelled this ungainly fowl to hear discourse so plainly,\nThough its answer little meaning—little relevancy bore;\nFor we cannot help agreeing that no living human being\nEver yet was blessed with seeing bird above his chamber door—\nBird or beast upon the sculptured bust above his chamber door,\nWith such name as \"Nevermore.\"\n\nBut the Raven, sitting lonely on the placid bust, spoke only\nThat one word, as if his soul in that one word he did outpour.\nNothing farther then he uttered—not a feather then he fluttered—\nTill I scarcely more than muttered \"Other friends have flown before—\nOn the morrow he will leave me, as my Hopes have flown before.\"\nThen the bird said \"Nevermore.\"\n\nStartled at the stillness broken by reply so aptly spoken,\n\"Doubtless,\" said I, \"what it utters is its only stock and store\nCaught from some unhappy master whom unmerciful Disaster\nFollowed fast and followed faster till his songs one burden bore—\nTill the dirges of his Hope that melancholy burden bore\nOf 'Never—nevermore'.\"\n\nBut the Raven still beguiling all my fancy into smiling,\nStraight I wheeled a cushioned seat in front of bird, and bust and door;\nThen, upon the velvet sinking, I betook myself to linking\nFancy unto fancy, thinking what this ominous bird of yore—\nWhat this grim, ungainly, ghastly, gaunt, and ominous bird of yore\nMeant in croaking \"Nevermore.\"\n\nThis I sat engaged in guessing, but no syllable expressing\nTo the fowl whose fiery eyes now burned into my bosom's core;\nThis and more I sat divining, with my head at ease reclining\nOn the cushion's velvet lining that the lamp-light gloated o'er,\nBut whose velvet-violet lining with the lamp-light gloating o'er,\nShe shall press, ah, nevermore!\n\nThen, methought, the air grew denser, perfumed from an unseen censer\nSwung by Seraphim whose foot-falls tinkled on the tufted floor.\n\"Wretch,\" I cried, \"thy God hath lent thee—by these angels he hath sent thee\nRespite—respite and nepenthe from thy memories of Lenore;\nQuaff, oh quaff this kind nepenthe and forget this lost Lenore!\"\nQuoth the Raven \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil!—prophet still, if bird or devil!—\nWhether Tempter sent, or whether tempest tossed thee here ashore,\nDesolate yet all undaunted, on this desert land enchanted—\nOn this home by Horror haunted—tell me truly, I implore—\nIs there—is there balm in Gilead?—tell me—tell me, I implore!\"\nQuoth the Raven \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil!—prophet still, if bird or devil!\nBy that Heaven that bends above us—by that God we both adore—\nTell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore—\nClasp a rare and radiant maiden whom the angels name Lenore.\"\nQuoth the Raven \"Nevermore.\"\n\n\"Be that word our sign of parting, bird or fiend!\" I shrieked, upstarting—\n\"Get thee back into the tempest and the Night's Plutonian shore!\nLeave no black plume as a token of that lie thy soul hath spoken!\nLeave my loneliness unbroken!—quit the bust above my door!\nTake thy beak from out my heart, and take thy form from off my door!\"\nQuoth the Raven \"Nevermore.\"\n\nAnd the Raven, never flitting, still is sitting, still is sitting\nOn the pallid bust of Pallas just above my chamber door;\nAnd his eyes have all the seeming of a demon's that is dreaming,\nAnd the lamp-light o'er him streaming throws his shadow on the floor;\nAnd my soul from out that shadow that lies floating on the floor\nShall be lifted—nevermore!"
  },
  "poetryfoundation.org/poems/42891/stopping-by-woods-on-a-snowy-evening": {
    "title": "Stopping by Woods on a Snowy Evening",
    "author": "Robert Frost",
    "type": "poem",
    "text": "Whose woods these are I think I know.\nHis house is in the village though;\nHe will not see me stopping here\nTo watch his woods fill up with snow.\n\nMy little horse must think it queer\nTo stop without a farmhouse near\nBetween the woods and frozen lake\nThe darkest evening of the year.\n\nHe gives his harness bells a shake\nTo ask if there is some mistake.\nThe only other sound's the sweep\nOf easy wind and downy flake.\n\nThe woods are lovely, dark and deep,\nBut I have promises to keep,\nAnd miles to go before I sleep,\nAnd miles to go before I sleep."
  },
  "poetryfoundation.org/poems/45474/o-captain-my-captain": {
    "title": "O Captain! My Captain!",
    "author": "Walt Whitman",
    "type": "poem",
    "text": "O Captain! my Captain! our fearful trip is done,\nThe ship has weather'd every rack, the prize we sought is won,\nThe port is near, the bells I hear, the people all exulting,\nWhile follow eyes the steady keel, the vessel grim and daring;\nBut O heart! heart! heart!\nO the bleeding drops of red,\nWhere on the deck my Captain lies,\nFallen cold and dead.\n\nO Captain! my Captain! rise up and hear the bells;\nRise up—for you the flag is flung—for you the bugle trills,\nFor you bouquets and ribbon'd wreaths—for you the shores a-crowding,\nFor you they call, the swaying mass, their eager faces turning;\nHere Captain! dear father!\nThis arm beneath your head!\nIt is some dream that on the deck,\nYou've fallen cold and dead.\n\nMy Captain does not answer, his lips are pale and still,\nMy father does not feel my arm, he has no pulse nor will,\nThe ship is anchor'd safe and sound, its voyage closed and done,\nFrom fearful trip the victor ship comes in with object won;\nExult O shores, and ring O bells!\nBut I with mournful tread,\nWalk the deck my Captain lies,\nFallen cold and dead."
  },
  "poetryfoundation.org/poems/46560/dulce-et-decorum-est": {
    "title": "Dulce et Decorum Est",
    "author": "Wilfred Owen",
    "type": "poem",
    "text": "Bent double, like old beggars under sacks,\nKnock-kneed, coughing like hags, we cursed through sludge,\nTill on the haunting flares we turned our backs,\nAnd towards our distant rest began to trudge.\nMen marched asleep. Many had lost their boots,\nBut limped on, blood-shod. All went lame; all blind;\nDrunk with fatigue; deaf even to the hoots\nOf gas-shells dropping softly behind.\n\nGas! GAS! Quick, boys!—An ecstasy of fumbling\nFitting the clumsy helmets just in time,\nBut someone still was yelling out and stumbling\nAnd flound'ring like a man in fire or lime.—\nDim through the misty panes and thick green light,\nAs under a green sea, I saw him drowning.\n\nIn all my dreams before my helpless sight,\nHe plunges at me, guttering, choking, drowning.\n\nIf in some smothering dreams, you too could pace\nBehind the wagon that we flung him in,\nAnd watch the white eyes writhing in his face,\nHis hanging face, like a devil's sick of sin;\nIf you could hear, at every jolt, the blood\nCome gargling from the froth-corrupted lungs,\nObscene as cancer, bitter as the cud\nOf vile, incurable sores on innocent tongues,—\nMy friend, you would not tell with such high zest\nTo children ardent for some desperate glory,\nThe old Lie: Dulce et decorum est\nPro patria mori."
  },
  "poetryfoundation.org/poems/43290/the-second-coming": {
    "title": "The Second Coming",
    "author": "W.B. Yeats",
    "type": "poem",
    "text": "Turning and turning in the widening gyre\nThe falcon cannot hear the falconer;\nThings fall apart; the centre cannot hold;\nMere anarchy is loosed upon the world,\nThe blood-dimmed tide is loosed, and everywhere\nThe ceremony of innocence is drowned;\nThe best lack all conviction, while the worst\nAre full of passionate intensity.\n\nSurely some revelation is at hand;\nSurely the Second Coming is at hand.\nThe Second Coming! Hardly are those words out\nWhen a vast image out of Spiritus Mundi\nTroubles my sight: somewhere in sands of the desert\nA shape with lion body and the head of a man,\nA gaze blank and pitiless as the sun,\nIs moving its slow thighs, while all about it\nReel shadows of the indignant desert birds.\nThe darkness drops again; but now I know\nThat twenty centuries of stony sleep\nWere vexed to nightmare by a rocking cradle,\nAnd what rough beast, its hour come round at last,\nSlouches towards Bethlehem to be born?"
  },
  "poetryfoundation.org/poems/44885/annabel-lee": {
    "title": "Annabel Lee",
    "author": "Edgar Allan Poe",
    "type": "poem",
    "text": "It was many and many a year ago,\nIn a kingdom by the sea,\nThat a maiden there lived whom you may know\nBy the name of Annabel Lee;\nAnd this maiden she lived with no other thought\nThan to love and be loved by me.\n\nI was a child and she was a child,\nIn this kingdom by the sea,\nBut we loved with a love that was more than love—\nI and my Annabel Lee—\nWith a love that the winged seraphs of Heaven\nCoveted her and me.\n\nAnd this was the reason that, long ago,\nIn this kingdom by the sea,\nA wind blew out of a cloud, chilling\nMy beautiful Annabel Lee;\nSo that her highborn kinsmen came\nAnd bore her away from me,\nTo shut her up in a sepulchre\nIn this kingdom by the sea.\n\nThe angels, not half so happy in Heaven,\nWent envying her and me—\nYes!—that was the reason (as all men know,\nIn this kingdom by the sea)\nThat the wind came out of the cloud by night,\nChilling and killing my Annabel Lee.\n\nBut our love it was stronger by far than the love\nOf those who were older than we—\nOf many far wiser than we—\nAnd neither the angels in Heaven above\nNor the demons down under the sea\nCan ever dissever my soul from the soul\nOf the beautiful Annabel Lee;\n\nFor the moon never beams, without bringing me dreams\nOf the beautiful Annabel Lee;\nAnd the stars never rise, but I feel the bright eyes\nOf the beautiful Annabel Lee;\nAnd so, all the night-tide, I lie down by the side\nOf my darling—my darling—my life and my bride,\nIn her sepulchre there by the sea—\nIn her tomb by the sounding sea."
  },
  "poetryfoundation.org/poems/44212/the-love-song-of-j-alfred-prufrock": {
    "title": "The Love Song of J. Alfred Prufrock",
    "author": "T.S. Eliot",
    "type": "poem",
    "text": "S'io credesse che mia risposta fosse\nA persona che mai tornasse al mondo,\nQuesta fiamma staria senza piu scosse.\nMa percioche giammai di questo fondo\nNon torno vivo alcun, s'i'odo il vero,\nSenza tema d'infamia ti rispondo.\n\nLet us go then, you and I,\nWhen the evening is spread out against the sky\nLike a patient etherized upon a table;\nLet us go, through certain half-deserted streets,\nThe muttering retreats\nOf restless nights in one-night cheap hotels\nAnd sawdust restaurants with oyster-shells:\nStreets that follow like a tedious argument\nOf insidious intent\nTo lead you to an overwhelming question ...\nOh, do not ask, \"What is it?\"\nLet us go and make our visit.\n\nIn the room the women come and go\nTalking of Michelangelo.\n\nThe yellow fog that rubs its back upon the window-panes,\nThe yellow smoke that rubs its muzzle on the window-panes,\nLicked its tongue into the corners of the evening,\nLingered upon the pools that stand in drains,\nLet fall upon its back the soot that falls from chimneys,\nSlipped by the terrace, made a sudden leap,\nAnd seeing that it was a soft October night,\nCurled once about the house, and fell asleep.\n\nAnd indeed there will be time\nFor the yellow smoke that slides along the street,\nRubbing its back upon the window-panes;\nThere will be time, there will be time\nTo prepare a face to meet the faces that you meet;\nThere will be time to murder and create,\nAnd time for all the works and days of hands\nThat lift and drop a question on your plate;\nTime for you and time for me,\nAnd time yet for a hundred indecisions,\nAnd for a hundred visions and revisions,\nBefore the taking of a toast and tea.\n\nIn the room the women come and go\nTalking of Michelangelo.\n\nAnd indeed there will be time\nTo wonder, \"Do I dare?\" and, \"Do I dare?\"\nTime to turn back and descend the stair,\nWith a bald spot in the middle of my hair—\n(They will say: \"How his hair is growing thin!\")\nMy morning coat, my collar mounting firmly to the chin,\nMy necktie rich and modest, but asserted by a simple pin—\n(They will say: \"But how his arms and legs are thin!\")\nDo I dare\nDisturb the universe?\nIn a minute there is time\nFor decisions and revisions which a minute will reverse.\n\nFor I have known them all already, known them all:\nHave known the evenings, mornings, afternoons,\nI have measured out my life with coffee spoons;\nI know the voices dying with a dying fall\nBeneath the music from a farther room.\nSo how should I presume?\n\nAnd I have known the eyes already, known them all—\nThe eyes that fix you in a formulated phrase,\nAnd when I am formulated, sprawling on a pin,\nWhen I am pinned and wriggling on the wall,\nThen how should I begin\nTo spit out all the butt-ends of my days and ways?\nAnd how should I presume?\n\nAnd I have known the arms already, known them all—\nArms that are braceleted and white and bare\n(But in the lamplight, downed with light brown hair!)\nIs it perfume from a dress\nThat makes me so digress?\nArms that lie along a table, or wrap about a shawl.\nAnd should I then presume?\nAnd how should I begin?\n\nShall I say, I have gone at dusk through narrow streets\nAnd watched the smoke that rises from the pipes\nOf lonely men in shirt-sleeves, leaning out of windows? ...\n\nI should have been a pair of ragged claws\nScuttling across the floors of silent seas.\n\nAnd the afternoon, the evening, sleeps so peacefully!\nSmoothed by long fingers,\nAsleep ... tired ... or it malingers,\nStretched on the floor, here beside you and me.\nShould I, after tea and cakes and ices,\nHave the strength to force the moment to its crisis?\nBut though I have wept and fasted, wept and prayed,\nThough I have seen my head (grown slightly bald) brought in upon a platter,\nI am no prophet—and here's no great matter;\nI have seen the moment of my greatness flicker,\nAnd I have seen the eternal Footman hold my coat, and snicker,\nAnd in short, I was afraid.\n\nAnd would it have been worth it, after all,\nAfter the cups, the marmalade, the tea,\nAmong the porcelain, among some talk of you and me,\nWould it have been worth while,\nTo have bitten off the matter with a smile,\nTo have squeezed the universe into a ball\nTo roll it towards some overwhelming question,\nTo say: \"I am Lazarus, come from the dead,\nCome back to tell you all, I shall tell you all\"—\nIf one, settling a pillow by her head\nShould say: \"That is not what I meant at all;\nThat is not it, at all.\"\n\nAnd would it have been worth it, after all,\nWould it have been worth while,\nAfter the sunsets and the dooryards and the sprinkled streets,\nAfter the novels, after the teacups, after the skirts that trail along the floor—\nAnd this, and so much more?—\nIt is impossible to say just what I mean!\nBut as if a magic lantern threw the nerves in patterns on a screen:\nWould it have been worth while\nIf one, settling a pillow or throwing off a shawl,\nAnd turning toward the window, should say:\n\"That is not it at all,\nThat is not what I meant, at all.\"\n\nNo! I am not Prince Hamlet, nor was meant to be;\nAm an attendant lord, one that will do\nTo swell a progress, start a scene or two,\nAdvise the prince; no doubt, an easy tool,\nDeferential, glad to be of use,\nPolitic, cautious, and meticulous;\nFull of high sentence, but a bit obtuse;\nAt times, indeed, almost ridiculous—\nAlmost, at times, the Fool.\n\nI grow old ... I grow old ...\nI shall wear the bottoms of my trousers rolled.\n\nShall I part my hair behind? Do I dare to eat a peach?\nI shall wear white flannel trousers, and walk upon the beach.\nI have heard the mermaids singing, each to each.\n\nI do not think that they will sing to me.\n\nI have seen them riding seaward on the waves\nCombing the white hair of the waves blown back\nWhen the wind blows the water white and black.\nWe have lingered in the chambers of the sea\nBy sea-girls wreathed with seaweed red and brown\nTill human voices wake us, and we drown."
  },
  "poetryfoundation.org/poems/49303/howl": {
    "title": "Howl (Part I)",
    "author": "Allen Ginsberg",
    "type": "poem",
    "text": "I saw the best minds of my generation destroyed by madness, starving hysterical naked,\ndragging themselves through the negro streets at dawn looking for an angry fix,\nangelheaded hipsters burning for the ancient heavenly connection to the starry dynamo in the machinery of night,\nwho poverty and tatters and hollow-eyed and high sat up smoking in the supernatural darkness of cold-water flats floating across the tops of cities contemplating jazz,\nwho bared their brains to Heaven under the El and saw Mohammedan angels staggering on tenement roofs illuminated,\nwho passed through universities with radiant cool eyes hallucinating Arkansas and Blake-light tragedy among the scholars of war,\nwho were expelled from the academies for crazy & publishing obscene odes on the windows of the skull,\nwho cowered in unshaven rooms in underwear, burning their money in wastebaskets and listening to the Terror through the wall,\nwho got busted in their pubic beards returning through Laredo with a belt of marijuana for New York,\nwho ate fire in paint hotels or drank turpentine in Paradise Alley, death, or purgatoried their torsos night after night\nwith dreams, with drugs, with waking nightmares, alcohol and cock and endless balls."
  },
  "poets.org/poem/do-not-go-gentle-good-night": {
    "title": "Do Not Go Gentle into That Good Night",
    "author": "Dylan Thomas",
    "type": "poem",
    "text": "Do not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.\n\nThough wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.\n\nGood men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.\n\nWild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.\n\nGrave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.\n\nAnd you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light."
  },
  "poets.org/poem/i-hear-america-singing": {
    "title": "I Hear America Singing",
    "author": "Walt Whitman",
    "type": "poem",
    "text": "I hear America singing, the varied carols I hear,\nThose of mechanics, each one singing his as it should be blithe and strong,\nThe carpenter singing his as he measures his plank or beam,\nThe mason singing his as he makes ready for work, or leaves off work,\nThe boatman singing what belongs to him in his boat, the deckhand singing on the steamboat deck,\nThe shoemaker singing as he sits on his bench, the hatter singing as he stands,\nThe wood-cutter's song, the ploughboy's on his way in the morning, or at noon intermission or at sundown,\nThe delicious singing of the mother, or of the young wife at work, or of the girl sewing or washing,\nEach singing what belongs to him or her and to none else,\nThe day what belongs to the day—at night the party of young fellows, robust, friendly,\nSinging with open mouths their strong melodious songs."
  }
}
